package com.classy.class_2021a_andb_3;

import java.util.ArrayList;

public class DataManager {


    public static ArrayList<Article> generateArticles() {
        ArrayList<Article> articles = new ArrayList<>();

        articles.add(new Article()
                .setType(Article.TYPE.NORMAL)
                .setTitle("מיקרוסופט עובדת על תמיכת נייטיב באפליקציות אנדרואיד על גבי ווינדוס 10")
                .setSubTitle("על פי דיווחים חדשים, במיקרוסופט עובדים על פרויקט בשם Latte שיאפשר הרצה של האפליקציות דרך התאמה של Linux Subsystem לאנדרואיד. אבל יש מהמורה די רצינית בדרך")
                .setContent("מיקרוסופט עובדת על תוכנה שתאפשר למפתחים להריץ את האפליקציות שלהם על ווינדוס 10, מבלי שיצטרכו לשנות את הקוד שלהן. איך זה יקרה? במיקרוסופט רוצים לאפשר למפתחים לארוז את האפליקציות שלהם לארוז את ה-APK שלהם ב-MSIX, הפורמט החדש לאריזת אפליקציות של מיקרוסופט.\n" +
                        "\n" +
                        "כן, אבל…\n" +
                        "במסגרת הפרויקט החדש של מיקרוסופט, שזכה לשם “לאטה”, היא תאפשר למפתחים להגיש את אפליקציות האנדרואיד שלהם לחנות הדי מקרטעת עד כה של מיקרוסופט ב-Windows 10, כדי שיוצעו להורדה עבור משתמשים. על פי הדיווחים, הפרויקט צפוי לצאת לפועל בשנה הבאה.\n" +
                        "\n" +
                        "במיקרוסופט שקלו בעבר לאפשר הרצת אפליקציות אנדרואיד נייטיב על ווינדוס, אך הפרויקט נגנז. כעת, אחרי שהשיקו בשנה שעברה את Your Phone – המשקף את סמארטפון האנדרואיד שלכם לווינדוס, נראה שבמיקרוסופט רוצים להוציא לפועל את היכולת להריץ גם אפליקציות שלמות על מערכת ההפעלה שלהם.")
                .setMainImage("https://files.geektime.co.il/wp-content/uploads/2016/06/WINDOWS-10-WALLPAPER.jpg")
        );

        articles.add(new Article()
                .setType(Article.TYPE.NORMAL)
                .setTitle("אפקט העבודה מהבית: שליש מהעובדים מרגישים יותר שחוקים")
                .setSubTitle("פעם לעבוד מהבית היה נשמע כמו חלום של כל עובד, אבל מחקר חדש חושף את מה שהרגישו רבים בחודשים האחרונים. אבל למרבה המזל יש מה לעשות")
                .setContent("מה שלומכם? יש מצב שאתם מרגישים קצת יותר עייפים לאחרונה? אולי חסרי אנרגיה, או אפילו שחוקים? אם עניתם כן, אתם ממש לא לבד.\n" +
                        "\n" +
                        "אם היינו שואלים אתכם רק לפני שנה מה דעתכם על לעבור לעבוד מהבית, לא רק פעם בשבוע אלא כל יום ולתקופה ארוכה, סביר להניח שחלקכם היה דווקא מתלהב מהרעיון. מה רע בלחסוך שעות של על הכביש בכל יום ומה כבר אפשר לעשות רק במשרד שאי אפשר לעשות מהבית? אומרים גם שהתפוקה של העובדים מהבית גבוהה יותר, לא? אז מה רע?\n" +
                        "\n" +
                        "מתברר שמה שנשמע פעם כמו חלום רחוק, נתפס עכשיו אצל חלקנו – כשאנחנו עובדים כבר כל כך הרבה זמן מהבית בלית ברירה – קצת פחות חלומי.")
                .setMainImage("https://files.geektime.co.il/wp-content/uploads/2020/11/tired-laptop-work-from-home-1606386379.jpg")
        );

        articles.add(new Article()
                .setType(Article.TYPE.AD)
                .setTitle("קנו עכשיו ביוקר")
                .setSubTitle("ותעבדו בשביל הבנקים 30 שנה")
                .setContent("")
                .setMainImage("https://www.richardmeier.com/wp-content/uploads/2016/05/SRD0765_FirstAve_S040_Thumbnail_640x480.jpg")
                .setButton("לחץ לקנייה")
        );

        articles.add(new Article()
                .setType(Article.TYPE.NORMAL)
                .setTitle("גאדג'טי מסקר: LG UltraWide 34WN80C-B – מסך רחב וקעור ברזולוצייה גבוהה עם חיבור USB-C")
                .setSubTitle("גל המסכים האחרון מבית LG שהושק בישראל הביא עימו מספר דגמים בסדרת ה-Ultragear של החברה, המיועדים לגיימרים, אך לצידם מצאנו גם דגמים המיועדים לשוק הפרטי והעסקי. את מסך ה-UltraWide של החברה מדגם LG 34WN80C-B, ומדובר במסך קעור בעל יחס תצוגה סינמטי, המגיע ברזולוציה גבוהה של WQHD, עם פאנל IPS בגודל 34 אינץ'.")
                .setContent("מסך ה-34WN80C של LG מגיע בגודל 34 אינץ', עם מסך בעל פאנל IPS בקצב רענון סטנדרטי של 60 הרץ. מדובר במסך קעור (1800R) בעל יחס תצוגה סינמטי של 21:9, המציע רזולוציית תצוגה מירבית של 1440×3440 פיקסלים, ואם תבחרו בהצגת תמונה ביחס 16:9, תקבלו עד 1440×2560 פיקסלים. בנוסף, מאפשר המסך זוויות צפייה רחבות של 178 מעלות, מציע כיסוי ל-99% מטווח הצבעים sRGB וגם תומך ב-HDR10 (אבל שימו לב לעוד על זה בהמשך).\n" +
                        "\n" +
                        "עיצוב המסך נאה, אך לא מרחיק לכת. תוכלו למצוא מעמד בעיצוב חצי מעגל המתאים לעיצובו של המסך הקעור, כאשר מי שכבר מכיר היטב את מסכיה של LG לא יתקשה למצוא את כפתור השליטה הבודד להפעלה, כיבוי וגישה לניווט בהגדרות התצוגה, ממש מתחת לאמצע המסך.")
                .setMainImage("https://www.gadgety.co.il/wp-content/themes/main/thumbs/2020/11/LG-34WN80C-B-main.jpg")
        );


        for (int i = 0; i < 20; i++) {
            articles.add(new Article()
                    .setType(Article.TYPE.NORMAL)
                    .setTitle("Title " + i)
                    .setSubTitle("SubTitle " + i)
                    .setContent("Content " + i)
                    .setMainImage("")
            );
        }


        return articles;
    }
}
